"""
序列切片示例
"""
# 对list进行切片,从1 开始,4 结束,步长为 1
my_list = [0, 1, 2, 3, 4, 5, 6]
result1 = my_list[1:4]
print(f"对list进行切片,从1 开始,4 结束,步长为 1:{result1}")
print("=====================================")

# 对tuple进行切片,从头开始,到最后结束,步长1
my_tuple = (0, 1, 2, 3, 4, 5, 6)
resul2 = my_tuple[:]
print(f"对tuple从头开始,到最后结束,步长为 1:{resul2}")
print("=====================================")

# 对str进行切片,从头开始,到最后结束,步长2
my_str = "你在干嘛呀"
resul3 = my_str[::2]
print(f"对str进行切片,从头开始,到最后结束,步长2:{resul3}")
print("=====================================")

# 对str进行切片,从头开始,到最后结束,步长-1
my_str = "你在干嘛呀"
resul3 = my_str[::-1]  # 等同于将序列反转了
print(f"对str进行切片,从头开始,到最后结束,步长-1:{resul3}")
print("=====================================")

# 对列表进行切片,从3开始,到1结束,步长-1
resul4 = my_list[3:1:-1]
print(f"对列表进行切片,从3开始,到1结束,步长-1:{resul4}")
print("=====================================")

# 对元组进行切片,从头开始,到尾结束,步长-2
resul5 = my_tuple[::-2]
print(f"对元组进行切片,从头开始,到尾结束,步长-2:{resul5}")
print("=====================================")
